#include "picolib.h"

// SPR INIT
int16_t spr_x = 0;
int16_t spr_y = 0;
int16_t spr_w = 7;
int16_t spr_h = 7;
int16_t spr_ix = 0;
int16_t spr_iy = 0;


// PAL INIT
int16_t pal_x = 0;
int16_t pal_y = 0;
int16_t pal_w = 7;
int16_t pal_h = 7;
int16_t pal_c = 0;
int16_t pal_ix = 0;
int16_t pal_iy = 0;

/* 
    MODE
    0 - STR
    1 - PAL
*/
uint8_t mode = 0;

// Работает только с png размером 128x128
uint16_t sprs_nums[16][16] = {
    {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15},
    {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31},
    {32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47},
    {48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63},
    {64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79},
    {80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95},
    {96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111},
    {112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127},
    {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143},
    {144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159},
    {160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175},
    {176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191},
    {192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207},
    {208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223},
    {224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239},
    {240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255}
};

uint8_t pals_nums[4][4] = {
    {0, 1, 2, 3},
    {4, 5, 6, 7},
    {8, 9, 10, 11},
    {12, 13, 14, 15}
};

void update(void) {
    if (btnp(4)) mode++;
    if (mode > 1) mode = 0;


    if (mode == 0) {
        if (btnp(0) && spr_ix > 0)   { spr_x -= 8; spr_ix--; }
        if (btnp(1) && spr_ix < 15)  { spr_x += 8; spr_ix++; }
        if (btnp(2) && spr_iy > 0)   { spr_y -= 8; spr_iy--; }
        if (btnp(3) && spr_iy < 15)  { spr_y += 8; spr_iy++; }

        camera(spr_x - 64, spr_y - 64);
    }
    if (mode == 1) {
        if (btnp(0) && pal_ix > 0) { pal_x -= 16; pal_ix--; }
        if (btnp(1) && pal_ix < 3) { pal_x += 16; pal_ix++; }
        if (btnp(2) && pal_iy > 0) { pal_y -= 16; pal_iy--; }
        if (btnp(3) && pal_iy < 3) { pal_y += 16; pal_iy++; }

        camera(-32, -32);
    }
}

void draw(void) {
    if (mode == 0) {
        cls(12);
        rectfill(0, 0, 127, 127, 0);
        spr_pro(0, 0, 0, 16, 16, false, false);
        rect(spr_x, spr_y, (spr_x + spr_w), (spr_y + spr_h), 6);
        print_pro("%d", spr_x - 60, spr_y - 60, 6, sprs_nums[spr_iy][spr_ix]);
    }
    if (mode == 1) {
        cls(12);
        // Рисуем палитру 4×4
        for (int row = 0; row < 4; row++) {
            for (int col = 0; col < 4; col++) {
                int color = row * 4 + col;          // индекс цвета 0..15
                int px = col * 16;                  // координата X квадрата
                int py = row * 16;                  // координата Y квадрата
                rectfill(px, py, px + 15, py + 15, color);
            }
        }

        rect(pal_x, pal_y, (pal_x + pal_w) + 8, (pal_y + pal_h) + 8, 6);
        print_pro("%d", -28, -28, 6, pals_nums[pal_iy][pal_ix]);
        rect(-1, -1, 64, 64, 0);
    }
}
